LabRat3K/PIC16F1-USB-Bootloader/HID/usb.c
/*
 * File:   Usb.c
 * Author: Szymon Roslowski
 *
 * Created on 13 October 2014, 17:46
 *
 * Firmware framework for USB I/O on PIC 16F1455 (and siblings)
 *
 * Based On
 *
 * Firmware framework for USB I/O on PIC 18F2455 (and siblings)
 * Copyright (C) 2005 Alexander Enzmann
 * adapted to MCC18 by Alberto Maccioni on 1/8/09
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111 USA
 * or see <http://www.gnu.org/licenses/>
 */

#include "usb.h"
#include "usb_descriptors.h"
#include "pic16f1455.h"
#include "log.h"

/***********************/
/* Local Definitions   */
/***********************/
volatile uint8_t DeviceState;
// Commands
#define GET_STATUS                  0x00
#define CLEAR_FEATURE               0x01
#define SET_FEATURE                 0x03
#define SET_ADDRESS                 0x05
#define GET_DESCRIPTOR              0x06
#define SET_DESCRIPTOR              0x07
#define GET_CONFIGURATION           0x08
#define SET_CONFIGURATION           0x09
#define GET_INTERFACE               0x0A
#define SET_INTERFACE               0x0B
#define SYNCH_FRAME                 0x0C

// Descriptor Types
#define DEVICE_DESCRIPTOR           0x01
#define CONFIGURATION_DESCRIPTOR    0x02
#define STRING_DESCRIPTOR           0x03
#define INTERFACE_DESCRIPTOR        0x04
#define ENDPOINT_DESCRIPTOR         0x05

// Class Descriptor Types
#define HID_DESCRIPTOR              0x21
#define REPORT_DESCRIPTOR           0x22
#define PHYSICAL_DESCRIPTOR         0x23

// HID Class specific requests
#define GET_REPORT                  0x01
#define GET_IDLE                    0x02
#define GET_PROTOCOL                0x03
#define SET_REPORT                  0x09
#define SET_IDLE                    0x0A
#define SET_PROTOCOL                0x0B

// Standard Feature Selectors
#define DEVICE_REMOTE_WAKEUP        0x01
#define ENDPOINT_HALT               0x00

// Device states (Chap 9.1.1)
#define DETACHED                    0x00
#define ATTACHED                    0x01
#define POWERED                     0x02
#define DEFAULT                     0x03
#define ADDRESS                     0x04
#define CONFIGURED                  0x05

/* Interrupt */
#define USB_SOF                     0x40
#define USB_STALL                   0x20
#define USB_IDLE                    0x10
#define USB_TRN                     0x08
#define USB_RESUM                   0x04
#define USB_UERR                    0x02
#define USB_URST                    0x01

// Buffer Descriptor bit masks (from PIC datasheet)
#define UOWN                        0x80 // USB Own Bit
#define DTS                         0x40 // Data Toggle Synchronization Bit
#define KEN                         0x20 // BD Keep Enable Bit
#define INCDIS                      0x10 // Address Increment Disable Bit
#define DTSEN                       0x08 // Data Toggle Synchronization Enable Bit
#define BSTALL                      0x04 // Buffer Stall Enable Bit
#define BC9                         0x02 // Byte count bit 9
#define BC8                         0x01 // Byte count bit 8

// Control Transfer Stages - see USB spec chapter 5
#define SETUP_STAGE                 0x00 // Start of a control transfer (followed by 0 or more data stages)
#define DATA_OUT_STAGE              0x01 // Data from host to device
#define DATA_IN_STAGE               0x02 // Data from device to host
#define STATUS_STAGE                0x03 // Unused - if data I/O went ok, then back to Setup

// Hardware
#define USB_RESET_FLAG              UIRbits.URSTIF
#define USB_RESUME_FLAG             UIRbits.ACTVIF
#define USB_IDLE_FLAG               UIRbits.IDLEIF
#define USB_STALL_FLAG              UIRbits.STALLIF
#define USB_SOF_FLAG                UIRbits.SOFIF
#define USB_ERROR_FLAG              UIRbits.UERRIF
#define USB_TRANSACTION_FLAG        UIRbits.TRNIF

/***********************/
/* Structures          */
/***********************/

typedef struct _BDT
{
    uint8_t Stat;
    uint8_t Cnt;
    uint16_t ADDR;
} BDT; //Buffer Descriptor Table

typedef struct _Interface
{
    BDT Output;
    BDT Input;
} Interface;

// Every device request starts with an 8 byte setup packet (USB 2.0, chap 9.3)
// with a standard layout.  The meaning of wValue and wIndex will
// vary depending on the request type and specific request.
typedef struct _setupPacketStruct
{
    uint8_t bmRequestType; // D7: Direction, D6..5: Type, D4..0: Recipient
    uint8_t bRequest;      // Specific request
    uint8_t wValue0;       // LSB of wValue
    uint8_t wValue1;       // MSB of wValue
    uint8_t wIndex0;       // LSB of wIndex
    uint8_t wIndex1;       // MSB of wIndex
    uint16_t wLength;       // Number of bytes to transfer if there's a data stage
    uint8_t extra[1];      // Fill out to same size as Endpoint 0 max buffer (E0SZ-7)
} setupPacketStruct;

/***********************/
/* Local Variables     */
/***********************/

uint8_t RemoteWakeup;
uint8_t DeviceAddress;
uint8_t SelfPowered;
uint8_t CtrlTransferStage; // Holds the current stage in a control transfer
uint8_t CurrentConfiguration;
uint8_t HIDPostProcess;    // Set to 1 if HID needs to process after the data stage
uint8_t RequestHandled;    // Set to 1 if request was understood and processed.
// HID Class variables
uint8_t HidIdleRate;
uint8_t HidProtocol; // [0] Boot Protocol [1] Report Protocol
uint8_t HidRxLen;    // # of bytes put into buffer

const uint8_t *ROMoutPtr;  // Data to send to the host
uint8_t *outPtr;           // Data to send to the host
uint8_t *inPtr;            // Data from the host
uint8_t transferType;	// 0=ram 1=rom
uint16_t wCount;            // Number of bytes of data

volatile setupPacketStruct SetupPacket;
volatile uint8_t ControlTransferBuffer[E0SZ];

