LabRat3K/PIC16F1-USB-Bootloader/HID/usb.c
// Actual USB Data Buffers
volatile uint8_t HIDRxBuffer[HidReportByteCount];
volatile uint8_t HIDTxBuffer[HidReportByteCount];

BufferInfo Buffers[(InterfaceCount * 2)] =
{
    { HidReportByteCount, (uint8_t*)&HIDTxBuffer },
    { HidReportByteCount, (uint8_t*)&HIDRxBuffer }
};


//volatile __data __at(0x0E99) uint8_t EndpointFlags[InterfaceCount]; // Endpoint Flag Registers
// LabRat - redefine an overlay for the UEPx registers
#define EndpointFlags  ((uint8_t *)(&(UEP1)))

// !!! It is ABSOLUTELY VITAL for the start of BDTs to point to 0x2000.
// !!! Won't work without it.
// *** LABRAT: SDCC needed to declare the BANKED start address (as we are only using EP0 & 1 .. fits in a single bank so no need to worry)
//volatile Interface Interfaces[InterfaceCount + 1] @ 0x2000;
volatile __data __at (0x20) Interface Interfaces[InterfaceCount + 1];
// ... The hours I've waisted before I found out... :(


/***********************/
/* Implementation      */
/***********************/
uint8_t IsUsbDataAvailable(uint8_t InterfaceNo)
{
    if(InterfaceNo >= InterfaceCount) return 0;
    if(!(Interfaces[InterfaceNo + 1].Output.Stat & UOWN))
    {
        return Interfaces[InterfaceNo + 1].Output.Cnt;
    }
    return 0;
}

void ReArmInterface(uint8_t InterfaceNo)
{
    //If there is data received in the recieved buffer
    //Indicate that we have processed it and get the endpoint
    //ready to receive next packet.

    if(!(Interfaces[InterfaceNo + 1].Output.Stat & UOWN))
    {
        //Interfaces[InterfaceNo + 1].Output.Cnt =  *BufferSizes[0];
        Interfaces[InterfaceNo + 1].Output.Cnt =  Buffers[(InterfaceNo * 2) + 1].Size;
        //Interfaces[InterfaceNo + 1].Output.Cnt =  sizeof(HIDRxBuffer);

  //      HIDRxBuffer
        if(Interfaces[InterfaceNo + 1].Output.Stat & DTS) {
            Interfaces[InterfaceNo + 1].Output.Stat = DTSEN;
            Interfaces[InterfaceNo + 1].Output.Stat |= UOWN;
        } else{
            Interfaces[InterfaceNo + 1].Output.Stat = DTS | DTSEN;
            Interfaces[InterfaceNo + 1].Output.Stat |= UOWN ;
        }
    }
}

void HIDSend(uint8_t InterfaceNo)
{
    // If the CPU still owns the SIE, then don't try to send anything.
    if (Interfaces[InterfaceNo + 1].Input.Stat & UOWN) return;
    // Toggle the data bit and give control to the SIE

    //Interfaces[InterfaceNo + 1].Input.Cnt = sizeof(HIDTxBuffer);
    Interfaces[InterfaceNo + 1].Input.Cnt =  Buffers[InterfaceNo * 2].Size;

    if(Interfaces[InterfaceNo + 1].Input.Stat & DTS) {
        Interfaces[InterfaceNo + 1].Input.Stat = DTSEN;
        Interfaces[InterfaceNo + 1].Input.Stat |= UOWN;
    } else {
        Interfaces[InterfaceNo + 1].Input.Stat = DTS | DTSEN;
        Interfaces[InterfaceNo + 1].Input.Stat |= UOWN;
    }
}

// After configuration is complete, this routine is called to initialize
// the endpoints (e.g., assign buffer addresses).
void HIDInitEndpoints(void)
{
    uint8_t i = 0;

    HidRxLen =0;

    for (i = 0 ; i < InterfaceCount; i++)
    {
        // Turn on both in and out for this endpoint
        EndpointFlags[i] = 0x1E;
        //Interfaces[i+1].Output.Cnt = sizeof(HIDRxBuffer);
        Interfaces[i + 1].Output.Cnt = Buffers[(i * 2) + 1].Size;

        //Interfaces[i+1].Output.ADDR = PTR16(&HIDRxBuffer);
        Interfaces[i + 1].Output.ADDR = PTR16(Buffers[(i * 2) + 1].Buffer);

        Interfaces[i + 1].Output.Stat = DTSEN;
        Interfaces[i + 1].Output.Stat |= UOWN;

        //Interfaces[i + 1].Input.ADDR = PTR16(&HIDTxBuffer);
        Interfaces[i + 1].Input.ADDR = PTR16(Buffers[(i * 2)].Buffer);
        Interfaces[i + 1].Input.Stat = DTS;

    }
}

// Process HID specific requests
void ProcessHIDRequest(void)
{
    uint8_t bRequest;

     // Has to be to the HID interface
    if((SetupPacket.bmRequestType & 0x1F) != 0x01 || (SetupPacket.wIndex0 != 0x00)) return;

    bRequest = SetupPacket.bRequest;

    if (bRequest == GET_DESCRIPTOR)
    {
        // Request for a descriptor.
        uint8_t descriptorType  = SetupPacket.wValue1;
        if (descriptorType == HID_DESCRIPTOR)
        {
            RequestHandled = 1;
            ROMoutPtr = (const uint8_t*)&ConfigurationDescriptor.HIDDescriptor;
            wCount = sizeof(ConfigurationDescriptor.HIDDescriptor);
            transferType=1;
        }
        else if (descriptorType == REPORT_DESCRIPTOR)
        {
            RequestHandled = 1;
            ROMoutPtr = (const uint8_t*)HIDReport;
            wCount = sizeof(HIDReport);
            transferType=1;
        }
        else if (descriptorType == PHYSICAL_DESCRIPTOR)
        {   // Do Nothing
        }
        else
        {   // Unsupported Descriptor
        }
    }

    if ((SetupPacket.bmRequestType & 0x60) != 0x20)
    {
        return;
    }

    // HID-specific requests.
    if (bRequest == GET_REPORT)
    {   // Do Nothing
    }

    else if (bRequest == SET_REPORT)
    {
        HIDPostProcess = 1;
        RequestHandled = 1;
    }

    else if (bRequest == GET_IDLE)
    {
        RequestHandled = 1;
        outPtr = &HidIdleRate;
        wCount = 1;
        transferType=0;
    }

    else if (bRequest == SET_IDLE)
    {
        RequestHandled = 1;
        HidIdleRate = SetupPacket.wValue1;
    }

    else if (bRequest == GET_PROTOCOL)
    {
        RequestHandled = 1;
        outPtr = &HidProtocol;
        wCount = 1;
	transferType=0;
    }

    else if (bRequest == SET_PROTOCOL)
    {
        RequestHandled = 1;
        HidProtocol = SetupPacket.wValue0;
    }

    else
    {   // Unknown Request
    }
}

// Process GET_DESCRIPTOR
static void GetDescriptor(void)
{
    if(SetupPacket.bmRequestType == 0x80)
    {
        uint8_t descriptorType  = SetupPacket.wValue1;
        uint8_t descriptorIndex = SetupPacket.wValue0;

        if (descriptorType == DEVICE_DESCRIPTOR)
        {
                RequestHandled = 1;
                ROMoutPtr = (const uint8_t *) & DeviceDescriptor;
                wCount = sizeof(DeviceDescriptor);
                transferType=1;
        }
        else if (descriptorType == CONFIGURATION_DESCRIPTOR)
        {
                RequestHandled = 1;
                ROMoutPtr = (const uint8_t*)&ConfigurationDescriptor;
                wCount = sizeof(ConfigurationDescriptor);
		transferType=1;
        }
        else if (descriptorType == STRING_DESCRIPTOR)
        {
                RequestHandled = 1;
                if(descriptorIndex >= StringDescriptorCount)
                    ROMoutPtr = (const uint8_t*)&StringDescriptor0;
                else
                    ROMoutPtr = *(StringDescriptorPointers + descriptorIndex);

                wCount = *ROMoutPtr;
		transferType=1;
        }
        else
        {   // Unknown Descriptor
        }
    }
}

// Process GET_STATUS
static void GetStatus(void)
{
    // Mask off the Recipient bits
    uint8_t recipient = SetupPacket.bmRequestType & 0x1F;
    ControlTransferBuffer[0] = 0;
    ControlTransferBuffer[1] = 0;

    // See where the request goes
    if (recipient == 0x00)
    {
        // Device
        RequestHandled = 1;
        // Set bits for self powered device and remote wakeup.
        if (SelfPowered)
            ControlTransferBuffer[0] |= 0x01;
        if (RemoteWakeup)
            ControlTransferBuffer[0] |= 0x02;
    }
    else if (recipient == 0x01)
    {
        // Interface
        RequestHandled = 1;
    }
    else if (recipient == 0x02)
    {
        // Endpoint
        uint8_t endpointNum = SetupPacket.wIndex0 & 0x0F;
        uint8_t endpointDir = SetupPacket.wIndex0 & 0x80;
        RequestHandled = 1;
        // Endpoint descriptors are 8 bytes long, with each in and out taking 4 bytes
        // within the endpoint. (See PIC datasheet.)
        inPtr = (uint8_t *)&Interfaces[0].Output + (endpointNum * 8);
        if (endpointDir)
            inPtr += 4;
        if(*inPtr & BSTALL)
            ControlTransferBuffer[0] = 0x01;
    }

