LabRat3K/PIC16F1-USB-Bootloader/HID/usb.c
    if (RequestHandled)
    {
        outPtr = (uint8_t *)&ControlTransferBuffer;
        wCount = 2;
	transferType=0;
    }
}

// Process SET_FEATURE and CLEAR_FEATURE
static void SetFeature(void)
{
    uint8_t recipient = SetupPacket.bmRequestType & 0x1F;
    uint8_t feature = SetupPacket.wValue0;

    if (recipient == 0x00)
    {
        // Device
        if (feature == DEVICE_REMOTE_WAKEUP)
        {
            RequestHandled = 1;
            if (SetupPacket.bRequest == SET_FEATURE)
                RemoteWakeup = 1;
            else
                RemoteWakeup = 0;
        }
        // TBD: Handle TEST_MODE
    }
    else if (recipient == 0x02)
    {
        // Endpoint
        uint8_t endpointNum = SetupPacket.wIndex0 & 0x0F;
        uint8_t endpointDir = SetupPacket.wIndex0 & 0x80;
        if ((feature == ENDPOINT_HALT) && (endpointNum != 0))
        {
            // Halt endpoint (as long as it isn't endpoint 0)
            RequestHandled = 1;
            // Endpoint descriptors are 8 bytes long, with each in and out taking 4 bytes
            // within the endpoint. (See PIC datasheet.)
            inPtr = (uint8_t *)&Interfaces[0].Output + (endpointNum * 8);
            if (endpointDir)
                inPtr += 4;

            if(SetupPacket.bRequest == SET_FEATURE)
                *inPtr = 0x84;
            else
            {
                if(endpointDir == 1)
                    *inPtr = 0x00;
                else
                    *inPtr = 0x88;
            }
        }
    }
}

void ProcessStandardRequest(void)
{
    uint8_t request = SetupPacket.bRequest;

    log_byte(SetupPacket.bRequest); // SUCCESS
    //log_byte(request); // FAIL
    //log_hex(SetupPacket.bRequest,FMT_HEX|FMT_SPACE); // SUCCESS
    //log_hex(request,FMT_HEX|FMT_SPACE); //FAIL

    if((SetupPacket.bmRequestType & 0x60) != 0x00) {
        // Not a standard request - don't process here.  Class or Vendor
        // requests have to be handled seperately.
        return;
    }


    if (request == SET_ADDRESS)
    {
            // Set the address of the device.  All future requests
            // will come to that address.  Can't actually set UADDR
            // to the new address yet because the rest of the SET_ADDRESS
            // transaction uses address 0.
            RequestHandled = 1;
            DeviceState = ADDRESS;
            DeviceAddress = SetupPacket.wValue0;
    }
    else if (request == GET_DESCRIPTOR)
    {
            GetDescriptor();
    }
    else if (request == SET_CONFIGURATION)
    {
            RequestHandled = 1;
            CurrentConfiguration = SetupPacket.wValue0;
            // TBD: ensure the new configuration value is one that
            // exists in the descriptor.
            if (CurrentConfiguration == 0)
                // If configuration value is zero, device is put in
                // address state (USB 2.0 - 9.4.7)
                DeviceState = ADDRESS;
            else
            {
                // Set the configuration.
                DeviceState = CONFIGURED;

                // Initialize the endpoints for all interfaces
                HIDInitEndpoints();

                // TBD: Add initialization code here for any additional
                // interfaces beyond the one used for the HID
            }
    }
    else if (request == GET_CONFIGURATION)
    {
            RequestHandled = 1;
            outPtr = (uint8_t*)&CurrentConfiguration;
            wCount = 1;
            transferType=0;
    }
    else if (request == GET_STATUS)
    {
            GetStatus();
    }
    else if ((request == CLEAR_FEATURE) ||
        (request == SET_FEATURE))
    {
            SetFeature();
    }
    else if (request == GET_INTERFACE)
    {
            // No support for alternate interfaces.  Send
            // zero back to the host.
            RequestHandled = 1;
            ControlTransferBuffer[0] = 0;
            outPtr = (uint8_t*)&ControlTransferBuffer;
            wCount = 1;
            transferType=0;
    }
    else if (request == SET_INTERFACE)
    {
            // No support for alternate interfaces - just ignore.
            RequestHandled = 1;
    }
/*
    else if (request == SET_DESCRIPTOR)
    {
    }
    else if (request == SYNCH_FRAME)
    {
    }
    else
    {
    }
*/
}

// Data stage for a Control Transfer that sends data to the host
void InDataStage(void)
{
    uint8_t i;
    uint16_t bufferSize;

    // Determine how many bytes are going to the host
    if(wCount < E0SZ)
        bufferSize = wCount;
    else
        bufferSize = E0SZ;

    // Load the high two bits of the byte count into BC8:BC9
    Interfaces[0].Input.Stat &= ~(BC8 | BC9); // Clear BC8 and BC9
    Interfaces[0].Input.Stat |= (uint8_t)((bufferSize & 0x0300) >> 8);
    Interfaces[0].Input.Cnt = (uint8_t)(bufferSize & 0xFF);
    Interfaces[0].Input.ADDR = PTR16(&ControlTransferBuffer);

    // Update the number of bytes that still need to be sent.  Getting
    // all the data back to the host can take multiple transactions, so
    // we need to track how far along we are.
    wCount = wCount - bufferSize;

    // Move data to the USB output buffer from wherever it sits now.
    inPtr = (uint8_t *)&ControlTransferBuffer;
	if(transferType==1) for(i=0;i<bufferSize;i++) *inPtr++ = *ROMoutPtr++;
	else for(i=0;i<bufferSize;i++) *inPtr++ = *outPtr++;
}

// Data stage for a Control Transfer that reads data from the host
void OutDataStage(void)
{
    uint16_t i, bufferSize;

    bufferSize = ((0x03 & Interfaces[0].Output.Stat) << 8) | Interfaces[0].Output.Cnt;

    // Accumulate total number of bytes read
    wCount = wCount + bufferSize;

    outPtr = (uint8_t*)&ControlTransferBuffer;

    for (i=0;i<bufferSize;i++)
    {
        *inPtr++ = *outPtr++;
    }
}

// Process the Setup stage of a control transfer.  This code initializes the
// flags that let the firmware know what to do during subsequent stages of
// the transfer.
void SetupStage(void)
{
    // Note: Microchip says to turn off the UOWN bit on the IN direction as
    // soon as possible after detecting that a SETUP has been received.
    Interfaces[0].Input.Stat &= ~UOWN;
    Interfaces[0].Output.Stat &= ~UOWN;

    // Initialize the transfer process
    CtrlTransferStage = SETUP_STAGE;
    RequestHandled = 0; // Default is that request hasn't been handled
    HIDPostProcess = 0; // Assume standard request until know otherwise
    wCount = 0;         // No bytes transferred

    // See if this is a standard (as definded in USB chapter 9) request
    ProcessStandardRequest();

