LabRat3K/PIC16F1-USB-Bootloader/HID/usb.c
    // See if the HID class can do something with it.
    ProcessHIDRequest();

    // TBD: Add handlers for any other classes/interfaces in the device

    if (!RequestHandled)
    {
        // If this service wasn't handled then stall endpoint 0
        Interfaces[0].Output.Cnt = E0SZ;
        Interfaces[0].Output.ADDR = PTR16(&SetupPacket);
        Interfaces[0].Output.Stat =  BSTALL;
        Interfaces[0].Input.Stat =   BSTALL;
        // Microchips warns to set this field last
        Interfaces[0].Output.Stat |= UOWN;
        Interfaces[0].Input.Stat  |= UOWN;
    }
    else
    if (SetupPacket.bmRequestType & 0x80) 
    {
        // Device-to-host
        if(SetupPacket.wLength < wCount)
            wCount = SetupPacket.wLength;
        InDataStage();
        CtrlTransferStage = DATA_IN_STAGE;
        // Reset the out buffer descriptor for endpoint 0
        Interfaces[0].Output.Cnt = E0SZ;
        Interfaces[0].Output.ADDR = PTR16(&SetupPacket);
        Interfaces[0].Output.Stat = UOWN;

        // Set the in buffer descriptor on endpoint 0 to send data
        Interfaces[0].Input.ADDR = PTR16(&ControlTransferBuffer);
        // Give to SIE, DATA1 packet, enable data toggle checks
        Interfaces[0].Input.Stat =  DTS | DTSEN;
        Interfaces[0].Input.Stat |= UOWN;
    }
    else
    {
        // Host-to-device
        CtrlTransferStage = DATA_OUT_STAGE;

        // Clear the input buffer descriptor
        Interfaces[0].Input.Cnt = 0;
        Interfaces[0].Input.Stat = DTS | DTSEN;
        Interfaces[0].Input.Stat |= UOWN;

        // Set the out buffer descriptor on endpoint 0 to receive data
        Interfaces[0].Output.Cnt = E0SZ;
        Interfaces[0].Output.ADDR = PTR16(&ControlTransferBuffer);
        // Give to SIE, DATA1 packet, enable data toggle checks
        Interfaces[0].Output.Stat  = DTS | DTSEN;
        Interfaces[0].Output.Stat |= UOWN;
    }

    // Enable SIE token and packet processing
    UCONbits.PKTDIS = 0;
}

// Configures the buffer descriptor for endpoint 0 so that it is waiting for
// the status stage of a control transfer.
void WaitForSetupStage(void)
{
    CtrlTransferStage = SETUP_STAGE;
    Interfaces[0].Output.Cnt = E0SZ;
    Interfaces[0].Output.ADDR = PTR16(&SetupPacket);
    Interfaces[0].Output.Stat = DTSEN; // Give to SIE, enable data toggle checks
    Interfaces[0].Output.Stat |= UOWN ;
    Interfaces[0].Input.Stat = 0x00;         // Give control to CPU
}

// This is the starting point for processing a Control Transfer.  The code directly
// follows the sequence of transactions described in the USB spec chapter 5.  The
// only Control Pipe in this firmware is the Default Control Pipe (endpoint 0).
// Control messages that have a different destination will be discarded.
void ProcessControlTransfer(void)
{
    if (USTAT == 0) // Endpoint 0: OUT
    {
        uint8_t PID = (Interfaces[0].Output.Stat & 0x3C) >> 2; // Pull PID from middle of BD0STAT
        if (PID == 0x0D) {
            // SETUP PID - a transaction is starting
            SetupStage();
        }
        else if (CtrlTransferStage == DATA_OUT_STAGE)
        {
            OutDataStage();
            if(Interfaces[0].Output.Stat & DTS) {
                Interfaces[0].Output.Stat = DTSEN;
                Interfaces[0].Output.Stat |= UOWN ;
            } else {
                Interfaces[0].Output.Stat = DTS | DTSEN;
                Interfaces[0].Output.Stat |= UOWN;
            }
        }
        else
        {
            // Prepare for the Setup stage of a control transfer
            WaitForSetupStage();
        }
    }

    else if(USTAT == 0x04) // Endpoint 0: IN
    {
        if ((UADDR == 0) && (DeviceState == ADDRESS))
        {
            // TBD: ensure that the new address matches the value of
            // "deviceAddress" (which came in through a SET_ADDRESS).
            UADDR = SetupPacket.wValue0;
            if(UADDR == 0)
                // If we get a reset after a SET_ADDRESS, then we need
                // to drop back to the Default state.
                DeviceState = DEFAULT;
        }

        if (CtrlTransferStage == DATA_IN_STAGE)
        {
            // Start (or continue) transmitting data
            InDataStage();

            // Turn control over to the SIE and toggle the data bit
            if(Interfaces[0].Input.Stat & DTS) {
                Interfaces[0].Input.Stat = DTSEN;
                Interfaces[0].Input.Stat |= UOWN;
            } else {
                Interfaces[0].Input.Stat = DTS | DTSEN;
                Interfaces[0].Input.Stat |= UOWN ;
            }
        }
        else
        {
            // Prepare for the Setup stage of a control transfer
            WaitForSetupStage();
        }
    }
    else
    {
    }
}

void ResetPPBuffers(void)
{
    do
    {
        UCONbits.PPBRST = 1;
		UCONbits.PPBRST = 0;
    } while(0);
}

void InitializeUSB(void)
{
    UCFG = 0x14; // Enable pullup resistors; full speed mode; No PingPong
    DeviceState = DETACHED;
    RemoteWakeup = 0x00;
    CurrentConfiguration = 0x00;
    UADDR = 0; // Reset USB Address
    UEIR = 0; // Clear all USB Error Interrupt Flags
    ResetPPBuffers();
    UCONbits.PKTDIS = 0;// Enable Packet Transfers
  // ?? Value in the array seems to be wrong ??
    Buffers[1].Buffer = (uint8_t * ) &HIDRxBuffer;
}

void EnableUSBModule(void)
{
    // TBD: Check for voltage coming from the USB cable and use that
    // as an indication we are attached.
    if(UCONbits.USBEN == 0)
    {
        UCON = 0;
        UIE = 0;
        UCONbits.USBEN = 1;
        DeviceState = ATTACHED;
        
    }

    while (UCONbits.SE0); //Single Ended Zero Is Set - Busywait for initial power-up

    // If we are attached and no single-ended zero is detected, then
    // we can move to the Powered state.
    UIR = 0;
    UIE = 0;
    UIEbits.URSTIE = 1; //USB Reset Interrupt Enable bit
    UIEbits.IDLEIE = 1; //Idle Detect Interrupt Enable bit
    DeviceState = POWERED;
}

// Unsuspend the device
void UnSuspend(void)
{



    UCONbits.SUSPND = 0;   // Bring USB module out of power conserve
    UIEbits.ACTVIE = 0;
    UIR &= 0xFB;
}

