LabRat3K/PIC16F1-USB-Bootloader/HID/usb.c
// Full speed devices get a Start Of Frame (SOF) packet every 1 millisecond.
// Nothing is currently done with this interrupt (it is simply masked out).
void StartOfFrame(void)
{
    // TBD: Add a callback routine to do something
    UIRbits.SOFIF = 0;
}

// This routine is called in response to the code stalling an endpoint.
void Stall(void)
{
    if(UEP0bits.EPSTALL == 1)
    {
        // Prepare for the Setup stage of a control transfer
        WaitForSetupStage();
        UEP0bits.EPSTALL = 0;
    }
    UIRbits.STALLIF = 0;
}

// Suspend all processing until we detect activity on the USB bus
void Suspend(void)
{
    UIEbits.ACTVIE = 1;                     // Enable bus activity interrupt
    UIR &= 0xEF;
    UCONbits.SUSPND = 1;                   // Put USB module in power conserve
}

void BusReset()
{
    UEIR  = 0x00; // Clear any pending Error Interrupts
    UIR   = 0x00; // Clear any pending USB interrupts
    UEIE  = 0x9f; // Enable ALL Error Interrupt
    UIE   = 0x7b; // Enable all *BUT* the ACTVIE interrupts
    UADDR = 0x00;

    // Set endpoint 0 as a control pipe
    UEP0 = 0x16;

    // Flush any pending transactions
    while (UIRbits.TRNIF == 1) UIRbits.TRNIF = 0;

    // Enable packet processing
    UCONbits.PKTDIS = 0;

    // Prepare for the Setup stage of a control transfer
    WaitForSetupStage();

    RemoteWakeup = 0;         // Remote wakeup is off by default
    SelfPowered = 0;          // Self powered is off by default
    CurrentConfiguration = 0; // Clear active configuration
    DeviceState = DEFAULT;
}

// Main entry point for USB tasks.  Checks interrupts, then checks for transactions.
void ProcessUSBTransactions(void)
{
    // See if the device is connected yet.
    if(DeviceState == DETACHED)
    {
        UIR = 0; // Clear All Interrupt Flags
        UsbInterrupt = 0; // Clear Global Usb Interrupt Flag
	return;
    }

    // If the USB became active then wake up from suspend
    if(UIRbits.ACTVIF && UIEbits.ACTVIE)
    {
        UnSuspend();
	ClearUsbInterruptFlag(USB_RESUM);
    }

    // If we are supposed to be suspended, then don't try performing any
    // processing.
    if(UCONbits.SUSPND == 1)
    {
        UIR = 0; // Clear All Interrupt Flags
        UsbInterrupt = 0; // Clear Global Usb Interrupt Flag
        return;
    }

     // Process a bus reset
    if (UIRbits.URSTIF && UIEbits.URSTIE)
    {
        BusReset();
    	ClearUsbInterruptFlag(USB_URST);
    }

    if (UIRbits.IDLEIF && UIEbits.IDLEIE)
    {
        // No bus activity for a while - suspend the firmware
        Suspend();
    	ClearUsbInterruptFlag(USB_IDLE);
    }

    if (UIRbits.SOFIF && UIEbits.SOFIE)
    {
        StartOfFrame();
        ClearUsbInterruptFlag(USB_SOF);
    }

    if (UIRbits.STALLIF && UIEbits.STALLIE)
    {
        Stall();
        ClearUsbInterruptFlag(USB_STALL);
    }

    if (UIRbits.UERRIF && UIEbits.UERRIE)
    {
        // TBD: See where the error came from.
        // Clear errors
        UIRbits.UERRIF = 0;
        UEIR = 0 ; //     Clear All Usb Error Interrupt Flags
        ClearUsbInterruptFlag(USB_UERR);
    }

    // Unless we have been reset by the host, no need to keep processing
    if (DeviceState < DEFAULT)
    {
        UIR = 0; // Clear All Interrupt Flags
        UsbInterrupt = 0; // Clear Global Usb Interrupt Flag
        return;
    }

    // A transaction has finished.  Try default processing on endpoint 0.
    if(UIRbits.TRNIF && UIEbits.TRNIE)
    {
        ProcessControlTransfer();
        ClearUsbInterruptFlag(USB_TRN);
    }
    UsbInterrupt = 0; // Clear Global Usb Interrupt Flag
}

